dsl/poas/structurizr-SystemContext-001.puml
@startuml
set separator none
title Make a Lasting Power of Attorney Online - System Context

top to bottom direction

skinparam {
  shadowing false
  arrowFontSize 10
  defaultTextAlignment center
  wrapWidth 200
  maxMessageSize 100
}

hide stereotype

skinparam person<<Attorney>> {
  BackgroundColor #08427b
  FontColor #ffffff
  BorderColor #052e56
}
skinparam person<<CertificateProvider>> {
  BackgroundColor #08427b
  FontColor #ffffff
  BorderColor #052e56
}
skinparam person<<Donor>> {
  BackgroundColor #08427b
  FontColor #ffffff
  BorderColor #052e56
}
skinparam rectangle<<LPADraftingContainer>> {
  BackgroundColor #438dd5
  FontColor #ffffff
  BorderColor #2e6295
  roundCorner 20
}
skinparam rectangle<<MakeaLastingPowerofAttorneyOnline>> {
  BackgroundColor #1168bd
  FontColor #ffffff
  BorderColor #0b4884
}
skinparam rectangle<<OPGAuthenticationService>> {
  BackgroundColor #438dd5
  FontColor #ffffff
  BorderColor #2e6295
  roundCorner 20
}

person "==Attorney\n<size:10>[Person]</size>\n\nAttorney interacting with a Lasting Power of Attorney." <<Attorney>> as Attorney
person "==Donor\n<size:10>[Person]</size>\n\nDonor drafting the Lasting Power of Attorney." <<Donor>> as Donor
person "==Certificate Provider\n<size:10>[Person]</size>\n\nCertificate Provider interacting with a Lasting Power of Attorney." <<CertificateProvider>> as CertificateProvider
rectangle "==Make a Lasting Power of Attorney Online\n<size:10>[Software System]</size>\n\nAllows users to draft a Lasting Power of Attorney online. [Owner: Modernising, Users: Vega]" <<MakeaLastingPowerofAttorneyOnline>> as MakeaLastingPowerofAttorneyOnline
rectangle "==LPA Drafting Container\n<size:10>[Software System]</size>\n\nStores and manages data for pre-registration. [Owner: Modernising, Users: Vega]" <<LPADraftingContainer>> as LPADraftingContainer
rectangle "==OPG Authentication Service\n<size:10>[Software System]</size>\n\nUser facing central Authentication service. [Owner: UaLPA, Users: Modernising]" <<OPGAuthenticationService>> as OPGAuthenticationService

MakeaLastingPowerofAttorneyOnline .[#707070,thickness=2].> Donor : "<color:#707070>interacts with"
MakeaLastingPowerofAttorneyOnline .[#707070,thickness=2].> Attorney : "<color:#707070>interacts with"
MakeaLastingPowerofAttorneyOnline .[#707070,thickness=2].> CertificateProvider : "<color:#707070>interacts with"
MakeaLastingPowerofAttorneyOnline .[#707070,thickness=2].> LPADraftingContainer : "<color:#707070>makes calls to"
MakeaLastingPowerofAttorneyOnline .[#707070,thickness=2].> OPGAuthenticationService : "<color:#707070>authenticates with"
@enduml
